
// имеются три точки с целочисленными координатами (x1, y1), (x2, y2), (x3, y3) которые являются вершинами треугольника
// определить принадлежит ли точка z с координатами (x, y) какой-либо стороне треугольника или лежит внутри или вне его

#include <iostream>

int main() {
	float a[2];
	float b[2];
	float c[2];
	float z[2];
	float i, j, k;
	//	a[0] = 0; a[1] = 0;
	//	b[0] = 9; b[1] = 0;
	//	c[0] = 0; c[1] = 9;
	//	z[0] = 2; z[1] = 2;
	std::cout << "введите координаты точки a" << std::endl;
	std::cin >> a[0] >> a[1];
	std::cout << "введите координаты точки b" << std::endl;
	std::cin >> b[0] >> b[1];
	std::cout << "введите координаты точки c" << std::endl;
	std::cin >> c[0] >> c[1];
	std::cout << "введите координаты точки z" << std::endl;
	std::cin >> z[0] >> z[1];
	i = (a[0] - z[0]) * (b[1] - a[1]) - (b[0] - a[0]) * (a[1] - z[1]);
	j = (b[0] - z[0]) * (c[1] - b[1]) - (c[0] - b[0]) * (b[1] - z[1]);
	k = (c[0] - z[0]) * (a[1] - c[1]) - (a[0] - c[0]) * (c[1] - z[1]);
	if (i == 0 && j == 0 && k == 0) {
		std::cout << "все точки равны" << std::endl;
	} else
	if (i == 0 && k == 0) {
		std::cout << "точка z равна точке a" << std::endl;
	} else
	if (i == 0 && j == 0) {
		std::cout << "точка z равна точке b" << std::endl;
	} else
	if (j == 0 && k == 0) {
		std::cout << "точка z равна точке c" << std::endl;
	} else
	if (i == 0) {
		std::cout << "точка z лежит на стороне ab" << std::endl;
	} else
	if (j == 0) {
		std::cout << "точка z лежит на стороне bc" << std::endl;
	} else
	if (j == 0) {
		std::cout << "точка z лежит на стороне cd" << std::endl;
	} else
	if (0 < i && 0 < j && 0 < k || i < 0 && j < 0 && k < 0) {
		std::cout << "точка z лежит внутри треугольника" << std::endl;
	} else {
		std::cout << "точка z лежит вне треугольника" << std::endl;
	}
}
